Revit 2027 API
IFCGuidKey.Equals Method
 Determines whether this IFCGuidKey is equal to another.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override bool Equals(
	Object other
)
Public Overrides Function Equals (
	other As Object
) As Boolean
public:
virtual bool Equals(
	Object^ other
) override
abstract Equals :
        other : Object -> bool
override Equals :
        other : Object -> bool
Parameters
other Object
 The IFCGuidKey with which to compare this IFCGuidKey.
Return Value
Boolean
 True if the given IFCGuidKey is equal to this one, or false otherwise.
See Also
Reference
IFCGuidKey Class
Autodesk.Revit.DB.IFC Namespace